spec/vcr/Spree_AvalaraTransaction/captured_orders/_commit_avatax/included_in_price/calculates_the_included_tax_amount_from_item_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R898860827","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #5 - 7253","TaxCode":"PC030000","ItemCode":"SKU-5","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R898860827","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '811'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:56:41 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '561'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z1723s7+OJNscibNluswq/e7H766P6nj/b3xjs7D+8f7D34KW5ctVl5vKjWyxbNH44/3bMfPy2aqflCIOPT03f5YtUW1TL8+E32LpuUjE4AhD7HZzvjewf+ZydZOV2XhP8s+DZ7Fx8TDdaQ4NXBw4ODT3doAPiC3nheLPOGvvleQuTCHy8q+uuj3e3nZ9rCvPryZOfeDj36cTYpyqK9xjdtvc7x6RMa7yyrr5/nl3mJL45ns1oJ3h94n0AAGhLhlY5nZ7yzT12bZvKRHfUwOfI2K0o7vBN0VzPKX71Gk1f5hWJ0/Bx/f2ddF82b6xX3+boliPZTQ4WdXXxEsL8GqgzoRbbgdsfPj58cf3GMz6mZ+zR9/eb4zWn65vj3/uiXJN9P8H9posR0s6Uf0J8fPdy9n75Ov5NN3zbVMn3dAqp+bRB/SmyNj0900r6olu1FtciJHvi0S5qXFUlBaV6+9+nuzj4+7lKM8JKPzpj2ezv39x48fIhveLDm/Z3d3Z3d+7sgyy9JRu+N+5d1cYGPf+5xx4T8PzaniM5YBAAA
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:56:41 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R898860827","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #5 - 7253","TaxCode":"PC030000","ItemCode":"SKU-5","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R898860827","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1157'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:56:42 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '707'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvTp4eHDw6c7B3oOPRvzF06zlL/Z2dh9u79zb3tvBF2+KRd602WIVfvVm99NH9z99tL8zvv/pvXv37t//KW5ctVl5vKjWyxbNd/fH+/fs50+LZmq+EdD49PRdvli1RbUMP36TvcsmJeMTQqEv8CH1y3ibz06ycrouaQSz4Nvs3cCosnfPi2Xe0DffS4gu+ONFRX99tLv9/ExbGEq9PNm5t0OPfpxNirJor/FNW69zfPqExjXL6uvn+WVe4ovj2azOmwbf8RsykofjT/fw0SvFaWe8s09wDWD56N4B/uwTi/DpjFFaRghIo87brCjt8OiTr4HDq/xCwR4/x98nQKjmgX/1Gh98Z10XzZvrFQN63QKi+fRFtuBPj58fPzn+4th+bmi6s4uPqEPXMH395vjNafrm+Pf+6Jck309+STIizP2JefZK3zFAnr0ixOnRj99zYvqEixHd0G1/fMAob6Tb7kP9sztV9ovOxPRI2qU5Ey1OYkMFS8qvgSoDclNg54qauU97E/P9RJooMZ0Y6Qf050cPd++nr9PvZNO3TbVMX7eAql8bxJ+SYsHHJzppX1TL9qJa5EQPfNolzcuK9FBpXr736e7OPj7uUozwko/OmPZ7O/f3Hjx0gzXv7+zu7uze3wVZhNMUOXy3++nOTvoyXy6b6/IyWxZZenyZpy++CyDazIBhWTID+G7WzIvlRUvo4NPNAyDEqG/6WLDFR09P8HdnAA/3+8gT7voQ8jwbr/JmXbbm+9fr6ZSQ/OiXJP8PXPNgnPQFAAA=
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:56:42 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R898860827","DocDate":"2019-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #5 - 7253","TaxCode":"PC030000","ItemCode":"SKU-5","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R898860827","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1157'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 20 Mar 2019 16:56:43 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '680'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z1723s7+OJNscibNluswq/e7H766P6nj/b3x5/uHjy89+Dgp7hx1Wbl8aJaL1s0390f79+znz8tmqn5RkDj09N3+WLVFtUy/PhN9i6blIxPCIW+wIc74/sP/M9OsnK6LmkEs+Db7F18VDRcQ4RXBw8PDj7dOdgzbzwvlnlD33wvIYLhjxcV/fXR7vbzM21hXn15snNvhx79OJsUZdFe45u2Xuf49AkNeJbV18/zy7zEF8ezWa0k74+8TyEAFSo8HH+6h49e6Xh2xjv71LVpJh/dO9A/u+SwXzzN26wo7fBO0F3NKH/1Gk1e5ReK0fFz/P2ddV00b65X3OfrliDaTw0VdnbxEcH+GqgyoBfZgtsdPz9+cvzFMT6nZu7T9PWb4zen6Zvj3/ujX5J8P/klyYgw9yfm2St9x6D07BV1R49+/LM6MfvjAybAxtHuPtQ/uxNjv/hhTMx7oMqA3BTccmK+n0gTJaYTI/2A/vzo4e799HX6nWz6tqmW6esWUPVrg/hT0jj4+EQn7Ytq2V5Ui5zogU+7pHlZkYIqzcv3Pt3d2cfHXYoRXvLRGdN+b+f+3oOHbrDm/Z3d3Z3d+7sgi3CaIofvdj/d2Ulf5stlc11eZssiS48v8/TFdwFEmxkwLAFmAN/NmnmxvGgJHXy6eQCEGPVNHwu2+OjpCf7uDODhfh95wl0fQh4z8v8AaQ5bJ/QFAAA=
    http_version: 
  recorded_at: Wed, 20 Mar 2019 16:56:43 GMT
recorded_with: VCR 4.0.0
